## Setting an Index in Pandas Dataframes

In [1]:
import pandas as pd

In [2]:
scores = {"student": ["John", "Mary", "Robert", 
                        "John", "Robert", "Robert", "Mary"],
          "subject": ["Algebra", "Physics", "Algebra",
                       "Calculus", "Calculus", "Physics", "Algebra"],
          "grade": [2.8, 3.5, 3.2, 3.8, 2.9, 3.1, 3.5] }

In [3]:
scores_df = pd.DataFrame(scores)

In [4]:
scores_df

   grade student   subject
0    2.8    John   Algebra
1    3.5    Mary   Physics
2    3.2  Robert   Algebra
3    3.8    John  Calculus
4    2.9  Robert  Calculus
5    3.1  Robert   Physics
6    3.5    Mary   Algebra

### Grouping

In [5]:
scores_df.groupby(["subject"]).mean()

             grade
subject
Algebra   3.166667
Calculus  3.350000
Physics   3.300000

In [8]:
scores_df.groupby("student").mean()

            grade
student
John     3.300000
Mary     3.500000
Robert   3.066667

### Setting an index

In [9]:
scores_df.set_index("student", inplace = True)

# NOT
# scores_df.set_index = "student"

In [10]:
scores_df

         grade   subject
student
John       2.8   Algebra
Mary       3.5   Physics
Robert     3.2   Algebra
John       3.8  Calculus
Robert     2.9  Calculus
Robert     3.1   Physics
Mary       3.5   Algebra

### Reseting the index

In [11]:
scores_df.reset_index()

  student  grade   subject
0    John    2.8   Algebra
1    Mary    3.5   Physics
2  Robert    3.2   Algebra
3    John    3.8  Calculus
4  Robert    2.9  Calculus
5  Robert    3.1   Physics
6    Mary    3.5   Algebra

In [12]:
scores_df

         grade   subject
student
John       2.8   Algebra
Mary       3.5   Physics
Robert     3.2   Algebra
John       3.8  Calculus
Robert     2.9  Calculus
Robert     3.1   Physics
Mary       3.5   Algebra

In [10]:
scores_df = scores_df.reset_index()

In [11]:
scores_df

  student  grade   subject
0    John    2.8   Algebra
1    Mary    3.5   Physics
2  Robert    3.2   Algebra
3    John    3.8  Calculus
4  Robert    2.9  Calculus
5  Robert    3.1   Physics
6    Mary    3.5   Algebra